{
  "terms": {
    "title": "Terms of Service",
    "lastUpdated": "March 14, 2024",
    "sections": [
      {
        "heading": "1. Acceptance of Terms",
        "content": "By accessing and using rSearch, you agree to be bound by these Terms of Service. Our search service provides access to various types of information through web, academic, and specialized searches."
      },
      {
        "heading": "2. Service Description",
        "content": "rSearch is a knowledge discovery platform that aggregates and analyzes information from multiple sources. We use advanced AI to help users find, understand, and utilize information effectively."
      },
      {
        "heading": "3. User Responsibilities",
        "content": "Users agree to use the service responsibly, not to automate queries without permission, and to respect intellectual property rights of content discovered through our service."
      },
      {
        "heading": "4. Data Usage",
        "content": "We process search queries to provide results and improve our service. Your usage helps us enhance search accuracy and relevance while maintaining privacy standards."
      }
    ]
  },
  "privacy": {
    "title": "Privacy Policy",
    "lastUpdated": "March 14, 2024",
    "sections": [
      {
        "heading": "Data Collection",
        "content": "We collect search queries, interaction patterns, and optional account information to provide and improve our service. We do not sell personal data to third parties."
      },
      {
        "heading": "How We Use Your Data",
        "content": "Your data helps us improve search results, develop new features, and maintain service quality. We use aggregated, anonymized data for research and analysis."
      },
      {
        "heading": "Data Protection",
        "content": "We employ industry-standard security measures to protect your data. All searches are encrypted, and we regularly audit our security practices."
      },
      {
        "heading": "Your Rights",
        "content": "You can request your data, opt out of data collection beyond essential functions, and delete your account data at any time."
      }
    ]
  },
  "about": {
    "title": "About rSearch",
    "sections": [
      {
        "heading": "Our Mission",
        "content": "rSearch aims to make knowledge discovery effortless and intelligent. We combine advanced search technology with AI to help you find exactly what you're looking for."
      },
      {
        "heading": "How It Works",
        "content": "Our platform aggregates information from multiple sources and uses AI to understand context, analyze content, and present the most relevant results for your queries."
      },
      {
        "heading": "Features",
        "content": "From academic research to patent searches, rSearch offers specialized search modes to help you discover knowledge across different domains. Our AI assists in summarizing and analyzing results for better understanding."
      },
      {
        "heading": "Technology",
        "content": "Built with cutting-edge technology, rSearch uses advanced language models, semantic search, and machine learning to provide intelligent search capabilities."
      }
    ]
  }
} 